package lesson11AvdancedStarts;

/**
 * Created by anton.sviatov on 28.08.2019.
 */
public class lesson11 {

}

// SQL with MySQL
/**
 * SQL and noSQL
 * Атрибути - поля класу, кортежі - об"єкти класу. Таблиця це клас.
 * АйДішки унікальні
 * Один до одного, Один до багатьох, багато до багатьох
 * Один до одного - спільна айдішка - первинний ключ і форейн ключ
 * Багато до багатьох - окрема табличка з айдішками, один товар може мати багато категорій і навпаки
 * Працюємо через ultimate.
 * Поставити UBUNTU
 * */